{
  "day": 1,
  "source": "https://youtu.be/WJGS2B673Zg",
  "markers": [
    {
      "time": 26,
      "surah": "Al-Baqara",
      "ayah": 1,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.58,
      "arabic_text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ الٓمٓ",
      "english_text": "Alif. Lam. Mim."
    },
    {
      "time": 34,
      "surah": "Al-Baqara",
      "ayah": 2,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.916,
      "arabic_text": "ذَٰلِكَ ٱلْكِتَٰبُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًۭى لِّلْمُتَّقِينَ",
      "english_text": "THIS DIVINE WRIT - let there be no doubt about it is [meant to be] a guidance for all the God-conscious."
    },
    {
      "time": 43,
      "surah": "Al-Baqara",
      "ayah": 3,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.796,
      "arabic_text": "ٱلَّذِينَ يُؤْمِنُونَ بِٱلْغَيْبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقْنَٰهُمْ يُنفِقُونَ",
      "english_text": "Who believe in [the existence of] that which is beyond the reach of human perception, and are constant in prayer, and spend on others out of what We provide for them as sustenance;"
    },
    {
      "time": 54,
      "surah": "Al-Baqara",
      "ayah": 4,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.859,
      "arabic_text": "وَٱلَّذِينَ يُؤْمِنُونَ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن قَبْلِكَ وَبِٱلْءَاخِرَةِ هُمْ يُوقِنُونَ",
      "english_text": "And who believe in that which has been bestowed from on high upon thee, [O Prophet,] as well as in that which was bestowed before thy time: for it is they who in their innermost are certain of the life to come!"
    },
    {
      "time": 67,
      "surah": "Al-Baqara",
      "ayah": 5,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.952,
      "arabic_text": "أُو۟لَٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
      "english_text": "It is they who follow the guidance [which comes from their Sustainer; and it is they, they who' shall attain to a happy state!"
    },
    {
      "time": 77,
      "surah": "Al-Baqara",
      "ayah": 6,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.886,
      "arabic_text": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ",
      "english_text": "BEHOLD, as for those who are bent on denying the truth - it is all one to them whether thou warnest them or dost not warn them: they will not believe."
    },
    {
      "time": 90,
      "surah": "Al-Baqara",
      "ayah": 7,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.823,
      "arabic_text": "خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰٓ أَبْصَٰرِهِمْ غِشَٰوَةٌۭ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌۭ",
      "english_text": "God; has sealed their hearts and their hearing, and over their eyes is a veil; and awesome suffering awaits them."
    },
    {
      "time": 101,
      "surah": "Al-Baqara",
      "ayah": 8,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.609,
      "arabic_text": "وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلْيَوْمِ ٱلْءَاخِرِ وَمَا هُم بِمُؤْمِنِينَ",
      "english_text": "And there are people who say, \"We do believe in God and the Last Day,\" the while they do not [really] believe."
    },
    {
      "time": 121,
      "surah": "Al-Baqara",
      "ayah": 9,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.593,
      "arabic_text": "يُخَٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُوا۟ وَمَا يَخْدَعُونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
      "english_text": "They would deceive God and those who have attained to faith-the while they deceive none but themselves, and perceive it not."
    },
    {
      "time": 129,
      "surah": "Al-Baqara",
      "ayah": 10,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.811,
      "arabic_text": "فِى قُلُوبِهِم مَّرَضٌۭ فَزَادَهُمُ ٱللَّهُ مَرَضًۭا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌۢ بِمَا كَانُوا۟ يَكْذِبُونَ",
      "english_text": "In their hearts is disease, and so God lets their disease increase; and grievous suffering awaits them because of their persistent lying."
    },
    {
      "time": 143,
      "surah": "Al-Baqara",
      "ayah": 11,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.859,
      "arabic_text": "وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ قَالُوٓا۟ إِنَّمَا نَحْنُ مُصْلِحُونَ",
      "english_text": "And when they are told, \"Do not spread corruption on earth,\" they answer, \"We are but improving things!\""
    },
    {
      "time": 152,
      "surah": "Al-Baqara",
      "ayah": 12,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.916,
      "arabic_text": "أَلَآ إِنَّهُمْ هُمُ ٱلْمُفْسِدُونَ وَلَٰكِن لَّا يَشْعُرُونَ",
      "english_text": "Oh, verily, it is they, they who are spreading corruption but they perceive it not?"
    },
    {
      "time": 165,
      "surah": "Al-Baqara",
      "ayah": 13,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.571,
      "arabic_text": "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓا۟ أَنُؤْمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُ ۗ أَلَآ إِنَّهُمْ هُمُ ٱلسُّفَهَآءُ وَلَٰكِن لَّا يَعْلَمُونَ",
      "english_text": "And when they are told, \"Believe as other people believe,\" they answer, \"Shall we believe as the weak-minded believe?\" Oh, verily, it is they, they who are weak-minded -but they know it not!"
    },
    {
      "time": 187,
      "surah": "Al-Baqara",
      "ayah": 14,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.78,
      "arabic_text": "وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَوْا۟ إِلَىٰ شَيَٰطِينِهِمْ قَالُوٓا۟ إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِءُونَ",
      "english_text": "And when they meet those who have attained to faith, they assert, \"We believe [as you believe]\"; but when they find themselves alone with their- evil impulses, they say, \"Verily, we are with you; we were only mocking!\""
    },
    {
      "time": 206,
      "surah": "Al-Baqara",
      "ayah": 15,
      "surah_number": 2,
      "juz": 1,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.778,
      "arabic_text": "ٱللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِى طُغْيَٰنِهِمْ يَعْمَهُونَ",
      "english_text": "God will requite them for their mockery, and will leave them for a while in their overweening arrogance, blindly stumbling to and fro:"
    },
    {
      "time": 219,
      "surah": "Al-Baqara",
      "ayah": 16,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.612,
      "arabic_text": "أُو۟لَٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلضَّلَٰلَةَ بِٱلْهُدَىٰ فَمَا رَبِحَت تِّجَٰرَتُهُمْ وَمَا كَانُوا۟ مُهْتَدِينَ",
      "english_text": "[for] it is they who have taken error in exchange for guidance; and neither has their bargain brought them gain, nor have they found guidance [elsewhere]."
    },
    {
      "time": 228,
      "surah": "Al-Baqara",
      "ayah": 17,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.709,
      "arabic_text": "مَثَلُهُمْ كَمَثَلِ ٱلَّذِى ٱسْتَوْقَدَ نَارًۭا فَلَمَّآ أَضَآءَتْ مَا حَوْلَهُۥ ذَهَبَ ٱللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِى ظُلُمَٰتٍۢ لَّا يُبْصِرُونَ",
      "english_text": "Their parable is that of people who kindle a fire: but as soon as it has illumined all around them, God takes away their light and leaves them in utter darkness, wherein they cannot see:"
    },
    {
      "time": 242,
      "surah": "Al-Baqara",
      "ayah": 18,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "صُمٌّۢ بُكْمٌ عُمْىٌۭ فَهُمْ لَا يَرْجِعُونَ",
      "english_text": "Deaf, dumb, blind - and they cannot turn back."
    },
    {
      "time": 255,
      "surah": "Al-Baqara",
      "ayah": 19,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.703,
      "arabic_text": "أَوْ كَصَيِّبٍۢ مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَٰتٌۭ وَرَعْدٌۭ وَبَرْقٌۭ يَجْعَلُونَ أَصَٰبِعَهُمْ فِىٓ ءَاذَانِهِم مِّنَ ٱلصَّوَٰعِقِ حَذَرَ ٱلْمَوْتِ ۚ وَٱللَّهُ مُحِيطٌۢ بِٱلْكَٰفِرِينَ",
      "english_text": "Or [the parable] of a violent cloudburst in the sky, with utter darkness, thunder and lightning: they put their fingers into their ears to keep out the peals of thunder, in terror of death; but God encompasses [with His might] all who deny the truth."
    },
    {
      "time": 283,
      "surah": "Al-Baqara",
      "ayah": 20,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.653,
      "arabic_text": "يَكَادُ ٱلْبَرْقُ يَخْطَفُ أَبْصَٰرَهُمْ ۖ كُلَّمَآ أَضَآءَ لَهُم مَّشَوْا۟ فِيهِ وَإِذَآ أَظْلَمَ عَلَيْهِمْ قَامُوا۟ ۚ وَلَوْ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَٰرِهِمْ ۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
      "english_text": "The lightning well-nigh takes away their sight; whenever it gives them light, they advance therein, and whenever darkness falls around them, they stand still. And if God so willed, He could indeed take away their hearing and their sight: for, verily, God has the power to will anything."
    },
    {
      "time": 418,
      "surah": "Al-Baqara",
      "ayah": 21,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.565,
      "arabic_text": "يَٰٓأَيُّهَا ٱلنَّاسُ ٱعْبُدُوا۟ رَبَّكُمُ ٱلَّذِى خَلَقَكُمْ وَٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
      "english_text": "O MANKIND! Worship your Sustainer, who has created you and those who lived before you, so that you might remain conscious of Him"
    },
    {
      "time": 439,
      "surah": "Al-Baqara",
      "ayah": 22,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ فِرَٰشًۭا وَٱلسَّمَآءَ بِنَآءًۭ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءًۭ فَأَخْرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزْقًۭا لَّكُمْ ۖ فَلَا تَجْعَلُوا۟ لِلَّهِ أَندَادًۭا وَأَنتُمْ تَعْلَمُونَ",
      "english_text": "who has made the earth a resting-place for you and the sky a canopy, and has sent down water from the sky and thereby brought forth fruits for your sustenance: do not, then, claim that there is any power that could rival God, when you know [that He is One]."
    },
    {
      "time": 460,
      "surah": "Al-Baqara",
      "ayah": 23,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.705,
      "arabic_text": "وَإِن كُنتُمْ فِى رَيْبٍۢ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا۟ بِسُورَةٍۢ مِّن مِّثْلِهِۦ وَٱدْعُوا۟ شُهَدَآءَكُم مِّن دُونِ ٱللَّهِ إِن كُنتُمْ صَٰدِقِينَ",
      "english_text": "And if you doubt any part of what We have, bestowed from on high, step by step, upon Our servant [Muhammad], then produce a surah of similar merit, and call upon any other than God to bear witness for you -if what you say is true!"
    },
    {
      "time": 494,
      "surah": "Al-Baqara",
      "ayah": 24,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.642,
      "arabic_text": "فَإِن لَّمْ تَفْعَلُوا۟ وَلَن تَفْعَلُوا۟ فَٱتَّقُوا۟ ٱلنَّارَ ٱلَّتِى وَقُودُهَا ٱلنَّاسُ وَٱلْحِجَارَةُ ۖ أُعِدَّتْ لِلْكَٰفِرِينَ",
      "english_text": "And if you cannot do it-and most certainly you cannot do it-then be conscious of the fire whose fuel is human beings and stones which awaits all who deny the truth!"
    },
    {
      "time": 508,
      "surah": "Al-Baqara",
      "ayah": 25,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.663,
      "arabic_text": "وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۖ كُلَّمَا رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍۢ رِّزْقًۭا ۙ قَالُوا۟ هَٰذَا ٱلَّذِى رُزِقْنَا مِن قَبْلُ ۖ وَأُتُوا۟ بِهِۦ مُتَشَٰبِهًۭا ۖ وَلَهُمْ فِيهَآ أَزْوَٰجٌۭ مُّطَهَّرَةٌۭ ۖ وَهُمْ فِيهَا خَٰلِدُونَ",
      "english_text": "But unto those who have attained to faith and do good works give the glad tiding that theirs shall be gardens through which running waters flow. Whenever they are granted fruits there from as their appointed sustenance, they will say, \"It is this that in days of yore was granted to us as our sustenance!\"-for they shall be given something that will recall that [past]. And there shall they have spouses pure, and there shall they abide."
    },
    {
      "time": 517,
      "surah": "Al-Baqara",
      "ayah": 26,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ إِنَّ ٱللَّهَ لَا يَسْتَحْىِۦٓ أَن يَضْرِبَ مَثَلًۭا مَّا بَعُوضَةًۭ فَمَا فَوْقَهَا ۚ فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ فَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ ۖ وَأَمَّا ٱلَّذِينَ كَفَرُوا۟ فَيَقُولُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَٰذَا مَثَلًۭا ۘ يُضِلُّ بِهِۦ كَثِيرًۭا وَيَهْدِى بِهِۦ كَثِيرًۭا ۚ وَمَا يُضِلُّ بِهِۦٓ إِلَّا ٱلْفَٰسِقِينَ",
      "english_text": "Behold, God does not disdain to propound a parable of a gnat, or of something [even] less than that. Now, as for those who have attained to faith, they know that it is the truth from their Sustainer - whereas those who are bent on denying the truth say, \"What could God mean by this parable?\" In this way does He cause many a one to go astray, just as He guides many a one aright: but none does He cause thereby to go astray save the iniquitous,"
    },
    {
      "time": 526,
      "surah": "Al-Baqara",
      "ayah": 27,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ٱلَّذِينَ يَنقُضُونَ عَهْدَ ٱللَّهِ مِنۢ بَعْدِ مِيثَٰقِهِۦ وَيَقْطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفْسِدُونَ فِى ٱلْأَرْضِ ۚ أُو۟لَٰٓئِكَ هُمُ ٱلْخَٰسِرُونَ",
      "english_text": "who break their bond with God after it has been established [in their nature], and cut asunder what God has bidden to be joined, and spread corruption on earth: these it is that shall be the losers."
    },
    {
      "time": 536,
      "surah": "Al-Baqara",
      "ayah": 28,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "كَيْفَ تَكْفُرُونَ بِٱللَّهِ وَكُنتُمْ أَمْوَٰتًۭا فَأَحْيَٰكُمْ ۖ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
      "english_text": "How can you refuse to acknowledge God, seeing that you were lifeless and He gave you life, and that He will cause you to die and then will bring you again to life, whereupon unto Him you will be brought back?"
    },
    {
      "time": 545,
      "surah": "Al-Baqara",
      "ayah": 29,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "هُوَ ٱلَّذِى خَلَقَ لَكُم مَّا فِى ٱلْأَرْضِ جَمِيعًۭا ثُمَّ ٱسْتَوَىٰٓ إِلَى ٱلسَّمَآءِ فَسَوَّىٰهُنَّ سَبْعَ سَمَٰوَٰتٍۢ ۚ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌۭ",
      "english_text": "He it is who has created for you all that is on earth, and has applied His design to the heavens and fashioned them into seven heavens; and He alone has full knowledge of everything."
    },
    {
      "time": 554,
      "surah": "Al-Baqara",
      "ayah": 30,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قَالَ رَبُّكَ لِلْمَلَٰٓئِكَةِ إِنِّى جَاعِلٌۭ فِى ٱلْأَرْضِ خَلِيفَةًۭ ۖ قَالُوٓا۟ أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ ٱلدِّمَآءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ ۖ قَالَ إِنِّىٓ أَعْلَمُ مَا لَا تَعْلَمُونَ",
      "english_text": "AND LO! Thy Sustainer said unto the angels: \"Behold, I am about to establish upon earth one who shall inherit it.\" They said: \"Wilt Thou place on it such as will spread corruption thereon and shed blood -whereas it is we who extol Thy limitless glory, and praise Thee, and hallow Thy name?\" [God] answered: \"Verily, I know that which you do not know.\""
    },
    {
      "time": 563,
      "surah": "Al-Baqara",
      "ayah": 31,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَعَلَّمَ ءَادَمَ ٱلْأَسْمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى ٱلْمَلَٰٓئِكَةِ فَقَالَ أَنۢبِـُٔونِى بِأَسْمَآءِ هَٰٓؤُلَآءِ إِن كُنتُمْ صَٰدِقِينَ",
      "english_text": "And He imparted unto Adam the names of all things; then He brought them within the ken of the angels and said: \"Declare unto Me the names of these [things], if what you say is true.\""
    },
    {
      "time": 573,
      "surah": "Al-Baqara",
      "ayah": 32,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قَالُوا۟ سُبْحَٰنَكَ لَا عِلْمَ لَنَآ إِلَّا مَا عَلَّمْتَنَآ ۖ إِنَّكَ أَنتَ ٱلْعَلِيمُ ٱلْحَكِيمُ",
      "english_text": "They replied: \"Limitless art Thou in Thy glory! No knowledge have we save that which Thou hast imparted unto us. Verily, Thou alone art all-knowing, truly wise.\""
    },
    {
      "time": 582,
      "surah": "Al-Baqara",
      "ayah": 33,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قَالَ يَٰٓـَٔادَمُ أَنۢبِئْهُم بِأَسْمَآئِهِمْ ۖ فَلَمَّآ أَنۢبَأَهُم بِأَسْمَآئِهِمْ قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّىٓ أَعْلَمُ غَيْبَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَأَعْلَمُ مَا تُبْدُونَ وَمَا كُنتُمْ تَكْتُمُونَ",
      "english_text": "Said He: \"O Adam, convey unto them the names of these [things].\" And as soon as [Adam] had conveyed unto them their names, [God] said: \"Did I not say unto you, `Verily, I alone know the hidden reality of the heavens and the earth, and know all that you bring into the open and all. that you would conceal'?\""
    },
    {
      "time": 591,
      "surah": "Al-Baqara",
      "ayah": 34,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قُلْنَا لِلْمَلَٰٓئِكَةِ ٱسْجُدُوا۟ لِءَادَمَ فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ أَبَىٰ وَٱسْتَكْبَرَ وَكَانَ مِنَ ٱلْكَٰفِرِينَ",
      "english_text": "And when We told the angels, \"Prostrate yourselves before Adam!\" -they all prostrated themselves, save Iblis, who refused and gloried in his arrogance: and thus he became one of those who deny the truth."
    },
    {
      "time": 600,
      "surah": "Al-Baqara",
      "ayah": 35,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَقُلْنَا يَٰٓـَٔادَمُ ٱسْكُنْ أَنتَ وَزَوْجُكَ ٱلْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ",
      "english_text": "And We said: \"O Adam, dwell thou and thy wife in this garden, and eat freely thereof, both of you, whatever you may wish; but do not approach this one tree, lest you become wrongdoers.\""
    },
    {
      "time": 610,
      "surah": "Al-Baqara",
      "ayah": 36,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "فَأَزَلَّهُمَا ٱلشَّيْطَٰنُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ ۖ وَقُلْنَا ٱهْبِطُوا۟ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّۭ ۖ وَلَكُمْ فِى ٱلْأَرْضِ مُسْتَقَرٌّۭ وَمَتَٰعٌ إِلَىٰ حِينٍۢ",
      "english_text": "But Satan caused them both to stumble therein, and thus brought about the loss of their erstwhile state. And so We said: \"Down with you, [and be henceforth] enemies unto one another; and on earth you shall have your abode and your livelihood for a while!\""
    },
    {
      "time": 619,
      "surah": "Al-Baqara",
      "ayah": 37,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "فَتَلَقَّىٰٓ ءَادَمُ مِن رَّبِّهِۦ كَلِمَٰتٍۢ فَتَابَ عَلَيْهِ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
      "english_text": "Thereupon Adam received words [of guidance] from his Sustainer, and He accepted his repentance: for, verily, He alone is the-Acceptor of Repentance, the Dispenser of Grace."
    },
    {
      "time": 628,
      "surah": "Al-Baqara",
      "ayah": 38,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قُلْنَا ٱهْبِطُوا۟ مِنْهَا جَمِيعًۭا ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًۭى فَمَن تَبِعَ هُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "english_text": "[For although] We did say, \"Down with you all from this [state],\" there shall, none the less, most certainly come unto you guidance from Me: and those who follow My guidance need have no fear, and neither shall they grieve;"
    },
    {
      "time": 637,
      "surah": "Al-Baqara",
      "ayah": 39,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَٰتِنَآ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
      "english_text": "but those who are bent on denying the truth and giving the lie to Our messages - they are destined for the fire, and therein shall they abide."
    },
    {
      "time": 647,
      "surah": "Al-Baqara",
      "ayah": 40,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَوْفُوا۟ بِعَهْدِىٓ أُوفِ بِعَهْدِكُمْ وَإِيَّٰىَ فَٱرْهَبُونِ",
      "english_text": "O CHILDREN of Israel! Remember those blessings of Mine with which I graced you, and fulfil your promise unto Me, [whereupon] I shall fulfil My promise unto you; and of Me, of Me stand in awe!"
    },
    {
      "time": 656,
      "surah": "Al-Baqara",
      "ayah": 41,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَءَامِنُوا۟ بِمَآ أَنزَلْتُ مُصَدِّقًۭا لِّمَا مَعَكُمْ وَلَا تَكُونُوٓا۟ أَوَّلَ كَافِرٍۭ بِهِۦ ۖ وَلَا تَشْتَرُوا۟ بِـَٔايَٰتِى ثَمَنًۭا قَلِيلًۭا وَإِيَّٰىَ فَٱتَّقُونِ",
      "english_text": "Believe in that which I have [now] bestowed from on high, confirming the truth already in your possession, and be not foremost among those who deny its truth; and do not barter away My messages for a trifling gain; and of Me, of Me be conscious"
    },
    {
      "time": 665,
      "surah": "Al-Baqara",
      "ayah": 42,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَا تَلْبِسُوا۟ ٱلْحَقَّ بِٱلْبَٰطِلِ وَتَكْتُمُوا۟ ٱلْحَقَّ وَأَنتُمْ تَعْلَمُونَ",
      "english_text": "And do not overlay the truth with falsehood, and do not knowingly suppress the truth;"
    },
    {
      "time": 667,
      "surah": "Al-Baqara",
      "ayah": 163,
      "surah_number": 2,
      "juz": 2,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.667,
      "arabic_text": "وَإِلَٰهُكُمْ إِلَٰهٌۭ وَٰحِدٌۭ ۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحْمَٰنُ ٱلرَّحِيمُ",
      "english_text": "AND YOUR GOD is the One God: there is no deity save Him, the Most Gracious, the Dispenser of Grace."
    },
    {
      "time": 674,
      "surah": "Al-Baqara",
      "ayah": 43,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَٱرْكَعُوا۟ مَعَ ٱلرَّٰكِعِينَ",
      "english_text": "and be constant in prayer, and spend in charity, and bow down in prayer with all who thus bow down."
    },
    {
      "time": 683,
      "surah": "Al-Baqara",
      "ayah": 44,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ أَتَأْمُرُونَ ٱلنَّاسَ بِٱلْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ ٱلْكِتَٰبَ ۚ أَفَلَا تَعْقِلُونَ",
      "english_text": "Do you bid other people to be pious, the while you forget your own selves -and yet you recite the divine writ? Will you not, then, use your reason?;"
    },
    {
      "time": 693,
      "surah": "Al-Baqara",
      "ayah": 45,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلْخَٰشِعِينَ",
      "english_text": "And seek aid in steadfast patience and prayer: and this, indeed, is a hard thing for all but the humble in spirit,"
    },
    {
      "time": 702,
      "surah": "Al-Baqara",
      "ayah": 46,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُوا۟ رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَٰجِعُونَ",
      "english_text": "who know with certainty that they shall meet their Sustainer and that unto Him they shall return."
    },
    {
      "time": 711,
      "surah": "Al-Baqara",
      "ayah": 47,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَنِّى فَضَّلْتُكُمْ عَلَى ٱلْعَٰلَمِينَ",
      "english_text": "O children of Israel! Remember those blessings of Mine with which I graced you, and how I favoured you above all other people;"
    },
    {
      "time": 720,
      "surah": "Al-Baqara",
      "ayah": 48,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَٱتَّقُوا۟ يَوْمًۭا لَّا تَجْزِى نَفْسٌ عَن نَّفْسٍۢ شَيْـًۭٔا وَلَا يُقْبَلُ مِنْهَا شَفَٰعَةٌۭ وَلَا يُؤْخَذُ مِنْهَا عَدْلٌۭ وَلَا هُمْ يُنصَرُونَ",
      "english_text": "and remain conscious of [the coming of] a Day when no human being shall in the least avail another, nor shall intercession be accepted from any of them, nor ransom taken from them, and none shall be succoured."
    },
    {
      "time": 730,
      "surah": "Al-Baqara",
      "ayah": 49,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ نَجَّيْنَٰكُم مِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ سُوٓءَ ٱلْعَذَابِ يُذَبِّحُونَ أَبْنَآءَكُمْ وَيَسْتَحْيُونَ نِسَآءَكُمْ ۚ وَفِى ذَٰلِكُم بَلَآءٌۭ مِّن رَّبِّكُمْ عَظِيمٌۭ",
      "english_text": "And [remember the time] when We saved you from Pharaoh's people, who afflicted you with cruel suffering, slaughtering your sons and sparing [only] your women - which was an awesome trial from your Sustainer;"
    },
    {
      "time": 739,
      "surah": "Al-Baqara",
      "ayah": 50,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ فَرَقْنَا بِكُمُ ٱلْبَحْرَ فَأَنجَيْنَٰكُمْ وَأَغْرَقْنَآ ءَالَ فِرْعَوْنَ وَأَنتُمْ تَنظُرُونَ",
      "english_text": "and when We cleft the sea before you, and thus saved you and caused Pharaoh's people to drown before your very eyes;"
    },
    {
      "time": 748,
      "surah": "Al-Baqara",
      "ayah": 51,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ وَٰعَدْنَا مُوسَىٰٓ أَرْبَعِينَ لَيْلَةًۭ ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ مِنۢ بَعْدِهِۦ وَأَنتُمْ ظَٰلِمُونَ",
      "english_text": "and when We appointed for Moses forty nights [on Mount Sinai], and in his absence you took to worshipping the [golden] calf, and thus became evildoers:"
    },
    {
      "time": 757,
      "surah": "Al-Baqara",
      "ayah": 52,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ثُمَّ عَفَوْنَا عَنكُم مِّنۢ بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ",
      "english_text": "yet, even after that, We blotted out this your sin, so that you might have cause to be grateful."
    },
    {
      "time": 767,
      "surah": "Al-Baqara",
      "ayah": 53,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ وَٱلْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ",
      "english_text": "And [remember the time] when We vouchsafed unto Moses the divine writ-and [thus] a standard by which to discern the true from the false -so that you might be guided aright;"
    },
    {
      "time": 776,
      "surah": "Al-Baqara",
      "ayah": 54,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦ يَٰقَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلْعِجْلَ فَتُوبُوٓا۟ إِلَىٰ بَارِئِكُمْ فَٱقْتُلُوٓا۟ أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌۭ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
      "english_text": "and when Moses said unto his people: \"O my people! Verily, you have sinned against yourselves by worshipping the calf; turn, then. in repentance to your Maker and mortify yourselves; this will be the best for you in your Maker's sight\". And thereupon He accepted your repentance: for, behold, He alone is the Acceptor of Repentance, the Dispenser of Grace."
    },
    {
      "time": 785,
      "surah": "Al-Baqara",
      "ayah": 55,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قُلْتُمْ يَٰمُوسَىٰ لَن نُّؤْمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهْرَةًۭ فَأَخَذَتْكُمُ ٱلصَّٰعِقَةُ وَأَنتُمْ تَنظُرُونَ",
      "english_text": "And [remember] when you said, \"O Moses. indeed we shall not believe thee unto we see God face to face!\" - whereupon the thunderbolt of punishment overtook you before your very eyes."
    },
    {
      "time": 794,
      "surah": "Al-Baqara",
      "ayah": 56,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ثُمَّ بَعَثْنَٰكُم مِّنۢ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
      "english_text": "But We raised you again after you had been as dead, so that you might have cause to be grateful."
    },
    {
      "time": 804,
      "surah": "Al-Baqara",
      "ayah": 57,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَظَلَّلْنَا عَلَيْكُمُ ٱلْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ ۖ كُلُوا۟ مِن طَيِّبَٰتِ مَا رَزَقْنَٰكُمْ ۖ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ",
      "english_text": "And We caused the clouds to comfort you with their shade, and sent down unto you manna and quails. [saying,] \"Partake of the good things which We have provided for you as sustenance.\" And [by all their sinning] they did no harm unto Us-but [only] against their own selves did they sin."
    },
    {
      "time": 813,
      "surah": "Al-Baqara",
      "ayah": 58,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قُلْنَا ٱدْخُلُوا۟ هَٰذِهِ ٱلْقَرْيَةَ فَكُلُوا۟ مِنْهَا حَيْثُ شِئْتُمْ رَغَدًۭا وَٱدْخُلُوا۟ ٱلْبَابَ سُجَّدًۭا وَقُولُوا۟ حِطَّةٌۭ نَّغْفِرْ لَكُمْ خَطَٰيَٰكُمْ ۚ وَسَنَزِيدُ ٱلْمُحْسِنِينَ",
      "english_text": "And [remember the time] when We said: \"Enter this land, and eat of its food as you may desire. abundantly; but enter the gate humbly and say, `Remove Thou from us the burden of our sins', [whereupon] We shall forgive you your sins, and shall amply reward the doers of good.\""
    },
    {
      "time": 822,
      "surah": "Al-Baqara",
      "ayah": 59,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "فَبَدَّلَ ٱلَّذِينَ ظَلَمُوا۟ قَوْلًا غَيْرَ ٱلَّذِى قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى ٱلَّذِينَ ظَلَمُوا۟ رِجْزًۭا مِّنَ ٱلسَّمَآءِ بِمَا كَانُوا۟ يَفْسُقُونَ",
      "english_text": "But those who were bent on evildoing substituted another saying for that which had been given them: and so We sent down upon those evildoers a plague from heaven in requital for all their iniquity."
    },
    {
      "time": 831,
      "surah": "Al-Baqara",
      "ayah": 60,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ وَإِذِ ٱسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِۦ فَقُلْنَا ٱضْرِب بِّعَصَاكَ ٱلْحَجَرَ ۖ فَٱنفَجَرَتْ مِنْهُ ٱثْنَتَا عَشْرَةَ عَيْنًۭا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍۢ مَّشْرَبَهُمْ ۖ كُلُوا۟ وَٱشْرَبُوا۟ مِن رِّزْقِ ٱللَّهِ وَلَا تَعْثَوْا۟ فِى ٱلْأَرْضِ مُفْسِدِينَ",
      "english_text": "And [remember] when Moses prayed for water for his people and We replied, \"Strike the rock with thy staff!\"-whereupon twelve springs gushed forth from it, so that all the people knew whence to drink. [And Moses said:] \"Eat and drink the sustenance provided by God, and do not act wickedly on earth by spreading corruption.\""
    },
    {
      "time": 840,
      "surah": "Al-Baqara",
      "ayah": 61,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قُلْتُمْ يَٰمُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍۢ وَٰحِدٍۢ فَٱدْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنۢبِتُ ٱلْأَرْضُ مِنۢ بَقْلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ ٱلَّذِى هُوَ أَدْنَىٰ بِٱلَّذِى هُوَ خَيْرٌ ۚ ٱهْبِطُوا۟ مِصْرًۭا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ وَٱلْمَسْكَنَةُ وَبَآءُو بِغَضَبٍۢ مِّنَ ٱللَّهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّۦنَ بِغَيْرِ ٱلْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
      "english_text": "And [remember] when you said: \"O Moses, indeed we cannot endure but one kind of food; pray, then, to thy Sustainer that He bring forth for us aught of what grows from the earth - of its herbs, its cucumbers, its garlic, its lentils, its onions.\" Said [Moses]: \"Would you take a lesser thing in exchange for what is [so much] better? Go back in shame to Egypt, and then you can have what you are asking for!\" And so, ignominy and humiliation overshadowed them, and they earned the burden of God's condemnation: all this, because they persisted in denying the truth of God's messages and in slaying the prophets against all right: all this, because they rebelled [against God], and persisted in transgressing the bounds of what is right."
    },
    {
      "time": 850,
      "surah": "Al-Baqara",
      "ayah": 62,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَٰرَىٰ وَٱلصَّٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ وَعَمِلَ صَٰلِحًۭا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "english_text": "VERILY, those who have attained to faith [in this divine writ], as well as those who follow the Jewish faith, and the Christians, and the Sabians -all who believe in God and the Last Day and do righteous deeds-shall have their reward with their Sustainer; and no fear need they have, and neither shall they grieve."
    },
    {
      "time": 859,
      "surah": "Al-Baqara",
      "ayah": 63,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ أَخَذْنَا مِيثَٰقَكُمْ وَرَفَعْنَا فَوْقَكُمُ ٱلطُّورَ خُذُوا۟ مَآ ءَاتَيْنَٰكُم بِقُوَّةٍۢ وَٱذْكُرُوا۟ مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ",
      "english_text": "AND LO! We accepted your solemn pledge, raising Mount Sinai high above you, [and saying;] \"Hold fast with [all your] strength unto what We have vouchsafed you, and bear in mind all that is therein, so that you might remain conscious of God!\""
    },
    {
      "time": 868,
      "surah": "Al-Baqara",
      "ayah": 64,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ثُمَّ تَوَلَّيْتُم مِّنۢ بَعْدِ ذَٰلِكَ ۖ فَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَكُنتُم مِّنَ ٱلْخَٰسِرِينَ",
      "english_text": "And you turned away after that-! And had it not been for God's favour upon you and His grace, you would surely have found yourselves among the lost;"
    },
    {
      "time": 877,
      "surah": "Al-Baqara",
      "ayah": 65,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَقَدْ عَلِمْتُمُ ٱلَّذِينَ ٱعْتَدَوْا۟ مِنكُمْ فِى ٱلسَّبْتِ فَقُلْنَا لَهُمْ كُونُوا۟ قِرَدَةً خَٰسِـِٔينَ",
      "english_text": "for you are well aware of those from among you who profaned the Sabbath, whereupon We said unto them, \"Be as apes despicable!\""
    },
    {
      "time": 887,
      "surah": "Al-Baqara",
      "ayah": 66,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "فَجَعَلْنَٰهَا نَكَٰلًۭا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةًۭ لِّلْمُتَّقِينَ",
      "english_text": "and set them up as a warning example for their time and for all times to come, as well as an admonition to all who are conscious of God."
    },
    {
      "time": 896,
      "surah": "Al-Baqara",
      "ayah": 67,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦٓ إِنَّ ٱللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا۟ بَقَرَةًۭ ۖ قَالُوٓا۟ أَتَتَّخِذُنَا هُزُوًۭا ۖ قَالَ أَعُوذُ بِٱللَّهِ أَنْ أَكُونَ مِنَ ٱلْجَٰهِلِينَ",
      "english_text": "AND LO! Moses said unto his people: \"Behold, God bids you to sacrifice a cow.\" They said: \"Dost thou mock at us?\" He answered: \"I seek refuge with God against being so ignorant!\""
    },
    {
      "time": 905,
      "surah": "Al-Baqara",
      "ayah": 68,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِىَ ۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ لَّا فَارِضٌۭ وَلَا بِكْرٌ عَوَانٌۢ بَيْنَ ذَٰلِكَ ۖ فَٱفْعَلُوا۟ مَا تُؤْمَرُونَ",
      "english_text": "Said they: \"Pray on our behalf unto thy Sustainer that He make clear to us what she is to be like.\" [Moses] replied: \"Behold, He says it is to be a cow neither old nor immature, but of art age in-between. Do, then, what you have been bidden!\""
    },
    {
      "time": 914,
      "surah": "Al-Baqara",
      "ayah": 69,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا ۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ صَفْرَآءُ فَاقِعٌۭ لَّوْنُهَا تَسُرُّ ٱلنَّٰظِرِينَ",
      "english_text": "Said they: \"Pray on our behalf unto thy Sustainer that He make clear to us what her colour should be. \"[Mopes] answered: \"Behold; He says it is to be a yellow cow, bright of hue, pleasing to the beholder.\""
    },
    {
      "time": 924,
      "surah": "Al-Baqara",
      "ayah": 70,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِىَ إِنَّ ٱلْبَقَرَ تَشَٰبَهَ عَلَيْنَا وَإِنَّآ إِن شَآءَ ٱللَّهُ لَمُهْتَدُونَ",
      "english_text": "Said' they: \"Pray on our behalf unto thy Sustainer that He make clear to us what she is to be like, for to us all cows resemble one another; and then, if God so wills, we shall truly be guided aright!\""
    },
    {
      "time": 933,
      "surah": "Al-Baqara",
      "ayah": 71,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ لَّا ذَلُولٌۭ تُثِيرُ ٱلْأَرْضَ وَلَا تَسْقِى ٱلْحَرْثَ مُسَلَّمَةٌۭ لَّا شِيَةَ فِيهَا ۚ قَالُوا۟ ٱلْـَٰٔنَ جِئْتَ بِٱلْحَقِّ ۚ فَذَبَحُوهَا وَمَا كَادُوا۟ يَفْعَلُونَ",
      "english_text": "[Moses] answered: \"Behold, He says it is to be a cow not broken-in to plough the earth or to water the crops, free of fault, without markings of any other colour.\"Said they: \"At last thou hast brought out the truth!\"-and thereupon they sacrificed her, although they had almost left it undone."
    },
    {
      "time": 942,
      "surah": "Al-Baqara",
      "ayah": 72,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قَتَلْتُمْ نَفْسًۭا فَٱدَّٰرَْٰٔتُمْ فِيهَا ۖ وَٱللَّهُ مُخْرِجٌۭ مَّا كُنتُمْ تَكْتُمُونَ",
      "english_text": "For, O children of Israel, because you had slain a human being and then cast the blame for this [crime] upon one another -although God will bring to light what you would conceals"
    },
    {
      "time": 951,
      "surah": "Al-Baqara",
      "ayah": 73,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "فَقُلْنَا ٱضْرِبُوهُ بِبَعْضِهَا ۚ كَذَٰلِكَ يُحْىِ ٱللَّهُ ٱلْمَوْتَىٰ وَيُرِيكُمْ ءَايَٰتِهِۦ لَعَلَّكُمْ تَعْقِلُونَ",
      "english_text": "We said: \"Apply this [principle] to some of those [cases of unresolved murder]: in this way God saves lives from death and shows you His will, so that you might [learn to] use your reason.\""
    },
    {
      "time": 960,
      "surah": "Al-Baqara",
      "ayah": 74,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ثُمَّ قَسَتْ قُلُوبُكُم مِّنۢ بَعْدِ ذَٰلِكَ فَهِىَ كَٱلْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةًۭ ۚ وَإِنَّ مِنَ ٱلْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ ٱلْأَنْهَٰرُ ۚ وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ ٱلْمَآءُ ۚ وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ ٱللَّهِ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
      "english_text": "And yet, after all this, your hearts hardened and became like rocks, or even harder: for, behold, there are rocks from which streams gush forth; and, behold, there are some from which, when they are cleft, water issues; and, behold, there are some that fall down for awe of God And God is not unmindful of what you do!"
    },
    {
      "time": 970,
      "surah": "Al-Baqara",
      "ayah": 75,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ أَفَتَطْمَعُونَ أَن يُؤْمِنُوا۟ لَكُمْ وَقَدْ كَانَ فَرِيقٌۭ مِّنْهُمْ يَسْمَعُونَ كَلَٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ",
      "english_text": "CAN YOU, then, hope that they will believe in what you are preaching - seeing that a good many of them were wont to listen to the word of God and then, after having understood it, to pervert it knowingly?"
    },
    {
      "time": 979,
      "surah": "Al-Baqara",
      "ayah": 76,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍۢ قَالُوٓا۟ أَتُحَدِّثُونَهُم بِمَا فَتَحَ ٱللَّهُ عَلَيْكُمْ لِيُحَآجُّوكُم بِهِۦ عِندَ رَبِّكُمْ ۚ أَفَلَا تَعْقِلُونَ",
      "english_text": "For, when they meet those who have attained to faith. they say, \"We believe [as you believe]\" - but when they find themselves alone with one another, they say. \"Do you inform them of what God has disclosed to you, so that they might use it in argument against you, quoting the words of your Sustainer? Will you not. then, use your reason?\""
    },
    {
      "time": 988,
      "surah": "Al-Baqara",
      "ayah": 77,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "أَوَلَا يَعْلَمُونَ أَنَّ ٱللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ",
      "english_text": "Do they not know, then, that God is aware of all that they would conceal as well as of all that they bring into the open?"
    },
    {
      "time": 997,
      "surah": "Al-Baqara",
      "ayah": 78,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ ٱلْكِتَٰبَ إِلَّآ أَمَانِىَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ",
      "english_text": "And there are among them unlettered people who have no real knowledge of the divine writ, [following] only wishful beliefs and depending on nothing but conjecture."
    },
    {
      "time": 1007,
      "surah": "Al-Baqara",
      "ayah": 79,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "فَوَيْلٌۭ لِّلَّذِينَ يَكْتُبُونَ ٱلْكِتَٰبَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هَٰذَا مِنْ عِندِ ٱللَّهِ لِيَشْتَرُوا۟ بِهِۦ ثَمَنًۭا قَلِيلًۭا ۖ فَوَيْلٌۭ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌۭ لَّهُم مِّمَّا يَكْسِبُونَ",
      "english_text": "Woe, then, unto those who write down, with their own hands, [something which they claim to be] divine writ, and then say. \"This is from God,\" in order to acquire a trifling gain thereby; woe, then, unto them for what their hands have written, and woe unto them for all that they may have gained!"
    },
    {
      "time": 1016,
      "surah": "Al-Baqara",
      "ayah": 80,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَقَالُوا۟ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامًۭا مَّعْدُودَةًۭ ۚ قُلْ أَتَّخَذْتُمْ عِندَ ٱللَّهِ عَهْدًۭا فَلَن يُخْلِفَ ٱللَّهُ عَهْدَهُۥٓ ۖ أَمْ تَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
      "english_text": "And they say, \"The fire will most certainly not touch us for more than a limited number of days.\" Say [unto them]: \"Have you received a promise from God - for God never breaks His promise - or do you attribute to God something which you cannot know?\""
    },
    {
      "time": 1025,
      "surah": "Al-Baqara",
      "ayah": 81,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "بَلَىٰ مَن كَسَبَ سَيِّئَةًۭ وَأَحَٰطَتْ بِهِۦ خَطِيٓـَٔتُهُۥ فَأُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
      "english_text": "Yea! Those who earn evil and by their sinfulness are engulfed - they are destined for the fire. therein to abide;"
    },
    {
      "time": 1034,
      "surah": "Al-Baqara",
      "ayah": 82,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْجَنَّةِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
      "english_text": "whereas those who attain to faith and do righteous deeds -they are destined for paradise, therein to abide."
    },
    {
      "time": 1044,
      "surah": "Al-Baqara",
      "ayah": 83,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ أَخَذْنَا مِيثَٰقَ بَنِىٓ إِسْرَٰٓءِيلَ لَا تَعْبُدُونَ إِلَّا ٱللَّهَ وَبِٱلْوَٰلِدَيْنِ إِحْسَانًۭا وَذِى ٱلْقُرْبَىٰ وَٱلْيَتَٰمَىٰ وَٱلْمَسَٰكِينِ وَقُولُوا۟ لِلنَّاسِ حُسْنًۭا وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ ثُمَّ تَوَلَّيْتُمْ إِلَّا قَلِيلًۭا مِّنكُمْ وَأَنتُم مُّعْرِضُونَ",
      "english_text": "AND LO! We accepted this solemn pledge from [you,] ' the children of Israel: \"You shall worship none but God; and you shall do good unto your parents and kinsfolk, and the orphans, and the poor; and you shall speak unto all people in a kindly way; and you shall be constant in prayer; and you shall spend in charity.” And yet, save for a few of you, you turned away: for you are obstinate folk!"
    },
    {
      "time": 1053,
      "surah": "Al-Baqara",
      "ayah": 84,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ أَخَذْنَا مِيثَٰقَكُمْ لَا تَسْفِكُونَ دِمَآءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَٰرِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ",
      "english_text": "And lo! We accepted your solemn pledge that you would not shed one another's blood, and would not drive one another from your homelands - whereupon you acknowledged it; and thereto you bear witness [even now]."
    },
    {
      "time": 1062,
      "surah": "Al-Baqara",
      "ayah": 85,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ثُمَّ أَنتُمْ هَٰٓؤُلَآءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًۭا مِّنكُم مِّن دِيَٰرِهِمْ تَظَٰهَرُونَ عَلَيْهِم بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَإِن يَأْتُوكُمْ أُسَٰرَىٰ تُفَٰدُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَٰبِ وَتَكْفُرُونَ بِبَعْضٍۢ ۚ فَمَا جَزَآءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْىٌۭ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَيَوْمَ ٱلْقِيَٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلْعَذَابِ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
      "english_text": "And yet, it is you who slay one another and drive some of your own people from their homelands, aiding one another against them in sin and hatred; but if they come to you as captives, you ransom them - although the very [act of] driving them away has been made unlawful to you!. Do you, then, believe in some parts of the divine writ and deny the truth of other parts? What, then, could be the reward of those among you who do such things but ignominy in the life of this world and, on the Day of Resurrection, commitment to most grievous suffering? For God is not unmindful of what you do."
    },
    {
      "time": 1071,
      "surah": "Al-Baqara",
      "ayah": 86,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "أُو۟لَٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلْحَيَوٰةَ ٱلدُّنْيَا بِٱلْءَاخِرَةِ ۖ فَلَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنصَرُونَ",
      "english_text": "All who buy the life of this world at the price of the life to come - their suffering shall not be lightened, nor shall they be succoured!"
    },
    {
      "time": 1081,
      "surah": "Al-Baqara",
      "ayah": 87,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ وَقَفَّيْنَا مِنۢ بَعْدِهِۦ بِٱلرُّسُلِ ۖ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَٰتِ وَأَيَّدْنَٰهُ بِرُوحِ ٱلْقُدُسِ ۗ أَفَكُلَّمَا جَآءَكُمْ رَسُولٌۢ بِمَا لَا تَهْوَىٰٓ أَنفُسُكُمُ ٱسْتَكْبَرْتُمْ فَفَرِيقًۭا كَذَّبْتُمْ وَفَرِيقًۭا تَقْتُلُونَ",
      "english_text": "For, indeed, We vouchsafed unto Moses the divine writ and caused apostle after apostle to follow him; and We vouchsafed unto Jesus, the son of Mary, all evidence of the truth, and strengthened him with holy inspiration. [Yet] is it not so that every time an apostle came unto you with something that was not to your liking, you gloried in your arrogance, and to some of them you gave the lie, while others you would slay?"
    },
    {
      "time": 1090,
      "surah": "Al-Baqara",
      "ayah": 88,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَقَالُوا۟ قُلُوبُنَا غُلْفٌۢ ۚ بَل لَّعَنَهُمُ ٱللَّهُ بِكُفْرِهِمْ فَقَلِيلًۭا مَّا يُؤْمِنُونَ",
      "english_text": "But they say, \"Our hearts are already full of knowledge.\" Nay, but God has rejected them because of their refusal to acknowledge the truth: for, few are the things in which they believe."
    },
    {
      "time": 1099,
      "surah": "Al-Baqara",
      "ayah": 89,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَمَّا جَآءَهُمْ كِتَٰبٌۭ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌۭ لِّمَا مَعَهُمْ وَكَانُوا۟ مِن قَبْلُ يَسْتَفْتِحُونَ عَلَى ٱلَّذِينَ كَفَرُوا۟ فَلَمَّا جَآءَهُم مَّا عَرَفُوا۟ كَفَرُوا۟ بِهِۦ ۚ فَلَعْنَةُ ٱللَّهِ عَلَى ٱلْكَٰفِرِينَ",
      "english_text": "And whenever there came unto them a [new] revelation from God, confirming the truth already in their possession-and [bear in mind that] aforetime they used to pray for victory over those who were bent on denying the truth -: whenever there came unto them something which they recognized [as the truth], they would deny it. And God's rejection is the due of all who deny the truth."
    },
    {
      "time": 1108,
      "surah": "Al-Baqara",
      "ayah": 90,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "بِئْسَمَا ٱشْتَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ أَن يَكْفُرُوا۟ بِمَآ أَنزَلَ ٱللَّهُ بَغْيًا أَن يُنَزِّلَ ٱللَّهُ مِن فَضْلِهِۦ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۖ فَبَآءُو بِغَضَبٍ عَلَىٰ غَضَبٍۢ ۚ وَلِلْكَٰفِرِينَ عَذَابٌۭ مُّهِينٌۭ",
      "english_text": "Vile is that [false pride] for which they have sold their own selves by denying the truth of what God has bestowed from on high, out of envy that God should bestow aught of His favour upon whomsoever He wills of His servants: and thus have they earned the burden of God's condemnation, over and over. And for those who deny the truth there is shameful suffering in store."
    },
    {
      "time": 1117,
      "surah": "Al-Baqara",
      "ayah": 91,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ بِمَآ أَنزَلَ ٱللَّهُ قَالُوا۟ نُؤْمِنُ بِمَآ أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَآءَهُۥ وَهُوَ ٱلْحَقُّ مُصَدِّقًۭا لِّمَا مَعَهُمْ ۗ قُلْ فَلِمَ تَقْتُلُونَ أَنۢبِيَآءَ ٱللَّهِ مِن قَبْلُ إِن كُنتُم مُّؤْمِنِينَ",
      "english_text": "For when they are told, \"Believe in what God has bestowed from on high,\" they reply, \"We believe [only] in what has been bestowed on us\"-and they deny the truth of everything else, although it be a truth confirming the one already in their possession. Say \"Why, then, did you slay God's prophets aforetime, if you were (truly] believers?\""
    },
    {
      "time": 1127,
      "surah": "Al-Baqara",
      "ayah": 92,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ وَلَقَدْ جَآءَكُم مُّوسَىٰ بِٱلْبَيِّنَٰتِ ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ مِنۢ بَعْدِهِۦ وَأَنتُمْ ظَٰلِمُونَ",
      "english_text": "And indeed, there came unto you Moses with all evidence of the truth - and thereupon. in his absence, you took to worshipping the (golden] calf, and acted wickedly."
    },
    {
      "time": 1136,
      "surah": "Al-Baqara",
      "ayah": 93,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ أَخَذْنَا مِيثَٰقَكُمْ وَرَفَعْنَا فَوْقَكُمُ ٱلطُّورَ خُذُوا۟ مَآ ءَاتَيْنَٰكُم بِقُوَّةٍۢ وَٱسْمَعُوا۟ ۖ قَالُوا۟ سَمِعْنَا وَعَصَيْنَا وَأُشْرِبُوا۟ فِى قُلُوبِهِمُ ٱلْعِجْلَ بِكُفْرِهِمْ ۚ قُلْ بِئْسَمَا يَأْمُرُكُم بِهِۦٓ إِيمَٰنُكُمْ إِن كُنتُم مُّؤْمِنِينَ",
      "english_text": "And, lo, We accepted your solemn pledge, raising Mount Sinai high above you, [saying,] \"Hold fast with [all your] strength unto what We have vouchsafed you, and hearken unto it!\" [But] they say, \"We have heard, but we disobey\" - for their hearts are filled to overflowing with love of the [golden] calf because of their refusal to acknowledge the truth. Say: \"Vile is what this [false] belief of yours enjoins upon you-if indeed you are believers!\""
    },
    {
      "time": 1145,
      "surah": "Al-Baqara",
      "ayah": 94,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قُلْ إِن كَانَتْ لَكُمُ ٱلدَّارُ ٱلْءَاخِرَةُ عِندَ ٱللَّهِ خَالِصَةًۭ مِّن دُونِ ٱلنَّاسِ فَتَمَنَّوُا۟ ٱلْمَوْتَ إِن كُنتُمْ صَٰدِقِينَ",
      "english_text": "Say: \"If an afterlife with God is to be for you alone, to the exclusion of all other people, then. you should long for death-if what you say is true!\""
    },
    {
      "time": 1154,
      "surah": "Al-Baqara",
      "ayah": 95,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَن يَتَمَنَّوْهُ أَبَدًۢا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّٰلِمِينَ",
      "english_text": "But never will they long for it, because [they are aware] of what their hands have sent ahead in this world: and God has full knowledge of evildoers."
    },
    {
      "time": 1164,
      "surah": "Al-Baqara",
      "ayah": 96,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَتَجِدَنَّهُمْ أَحْرَصَ ٱلنَّاسِ عَلَىٰ حَيَوٰةٍۢ وَمِنَ ٱلَّذِينَ أَشْرَكُوا۟ ۚ يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍۢ وَمَا هُوَ بِمُزَحْزِحِهِۦ مِنَ ٱلْعَذَابِ أَن يُعَمَّرَ ۗ وَٱللَّهُ بَصِيرٌۢ بِمَا يَعْمَلُونَ",
      "english_text": "And thou wilt most certainly find that they cling to life more eagerly than any other people, even more than those who are bent on ascribing divinity to other beings beside God: every one of them would love to live a thousand years, although the grant of long life could not save him from suffering [in the hereafter]: for God sees all that they do."
    },
    {
      "time": 1173,
      "surah": "Al-Baqara",
      "ayah": 97,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قُلْ مَن كَانَ عَدُوًّۭا لِّجِبْرِيلَ فَإِنَّهُۥ نَزَّلَهُۥ عَلَىٰ قَلْبِكَ بِإِذْنِ ٱللَّهِ مُصَدِّقًۭا لِّمَا بَيْنَ يَدَيْهِ وَهُدًۭى وَبُشْرَىٰ لِلْمُؤْمِنِينَ",
      "english_text": "SAY [O Prophet]: \"Whosoever is an enemy of Gabriel\" -who,, verily, by God's leave, has brought down upon thy heart this [divine writ] which confirms the truth of whatever there still remains [of earlier revelations], and is a guidance and a glad tiding for the believers-:"
    },
    {
      "time": 1182,
      "surah": "Al-Baqara",
      "ayah": 98,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "مَن كَانَ عَدُوًّۭا لِّلَّهِ وَمَلَٰٓئِكَتِهِۦ وَرُسُلِهِۦ وَجِبْرِيلَ وَمِيكَىٰلَ فَإِنَّ ٱللَّهَ عَدُوٌّۭ لِّلْكَٰفِرِينَ",
      "english_text": "\"whosover is an enemy of God and His angels and His message-bearers, including Gabriel and Michael, [should know that,] verily, God is the enemy of all who deny the truth.\""
    },
    {
      "time": 1191,
      "surah": "Al-Baqara",
      "ayah": 99,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَقَدْ أَنزَلْنَآ إِلَيْكَ ءَايَٰتٍۭ بَيِّنَٰتٍۢ ۖ وَمَا يَكْفُرُ بِهَآ إِلَّا ٱلْفَٰسِقُونَ",
      "english_text": "For, clear messages indeed have We bestowed upon thee from on high; and none denies their truth save the iniquitous."
    },
    {
      "time": 1201,
      "surah": "Al-Baqara",
      "ayah": 100,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "أَوَكُلَّمَا عَٰهَدُوا۟ عَهْدًۭا نَّبَذَهُۥ فَرِيقٌۭ مِّنْهُم ۚ بَلْ أَكْثَرُهُمْ لَا يُؤْمِنُونَ",
      "english_text": "Is it not so that every time they made a promise [unto God], some of them cast it aside? Nay, indeed: most of them do not believe."
    },
    {
      "time": 1210,
      "surah": "Al-Baqara",
      "ayah": 101,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَمَّا جَآءَهُمْ رَسُولٌۭ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌۭ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌۭ مِّنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ كِتَٰبَ ٱللَّهِ وَرَآءَ ظُهُورِهِمْ كَأَنَّهُمْ لَا يَعْلَمُونَ",
      "english_text": "And [even now,] when there has come unto them an apostle from God, confirming the truth already in their possession, some of those who were granted revelation aforetime cast the divine writ behind their backs as though unaware [of what it says],"
    },
    {
      "time": 1219,
      "surah": "Al-Baqara",
      "ayah": 102,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَٱتَّبَعُوا۟ مَا تَتْلُوا۟ ٱلشَّيَٰطِينُ عَلَىٰ مُلْكِ سُلَيْمَٰنَ ۖ وَمَا كَفَرَ سُلَيْمَٰنُ وَلَٰكِنَّ ٱلشَّيَٰطِينَ كَفَرُوا۟ يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحْرَ وَمَآ أُنزِلَ عَلَى ٱلْمَلَكَيْنِ بِبَابِلَ هَٰرُوتَ وَمَٰرُوتَ ۚ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّىٰ يَقُولَآ إِنَّمَا نَحْنُ فِتْنَةٌۭ فَلَا تَكْفُرْ ۖ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِۦ بَيْنَ ٱلْمَرْءِ وَزَوْجِهِۦ ۚ وَمَا هُم بِضَآرِّينَ بِهِۦ مِنْ أَحَدٍ إِلَّا بِإِذْنِ ٱللَّهِ ۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ ۚ وَلَقَدْ عَلِمُوا۟ لَمَنِ ٱشْتَرَىٰهُ مَا لَهُۥ فِى ٱلْءَاخِرَةِ مِنْ خَلَٰقٍۢ ۚ وَلَبِئْسَ مَا شَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ ۚ لَوْ كَانُوا۟ يَعْلَمُونَ",
      "english_text": "and follow [instead] that which the evil ones used to practice during Solomon's reign - for it was not Solomon who denied the truth, but those evil ones denied it by teaching people sorcery -; and [they follow] that which has come down through the two angels in Babylon, Hurut and Marut-although these two never taught it to anyone without first declaring, \"We are but a temptation to evil: do not, then, deny [God's] truth!\" And they learn from these two how to create discord between a man and his wife; but whereas they can harm none thereby save by God's leave, they acquire a knowledge that only harms themselves and does not benefit them - although they know; indeed, that he who acquires this [knowledge] shall have no share in the good of the life to come. For, vile indeed is that [art] for which they have sold their own selves -had they but known it!"
    },
    {
      "time": 1228,
      "surah": "Al-Baqara",
      "ayah": 103,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَوْ أَنَّهُمْ ءَامَنُوا۟ وَٱتَّقَوْا۟ لَمَثُوبَةٌۭ مِّنْ عِندِ ٱللَّهِ خَيْرٌۭ ۖ لَّوْ كَانُوا۟ يَعْلَمُونَ",
      "english_text": "And had they but believed and been conscious of Him, reward from God would indeed have brought them good-had they but known it!"
    },
    {
      "time": 1238,
      "surah": "Al-Baqara",
      "ayah": 104,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَقُولُوا۟ رَٰعِنَا وَقُولُوا۟ ٱنظُرْنَا وَٱسْمَعُوا۟ ۗ وَلِلْكَٰفِرِينَ عَذَابٌ أَلِيمٌۭ",
      "english_text": "O YOU who have attained to faith! Do not say [to the Prophet], \"Listen to us,\" but rather say, \"Have patience with us,\" and hearken [unto him], since grievous suffering awaits those who deny the truth."
    },
    {
      "time": 1247,
      "surah": "Al-Baqara",
      "ayah": 105,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "مَّا يَوَدُّ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَٰبِ وَلَا ٱلْمُشْرِكِينَ أَن يُنَزَّلَ عَلَيْكُم مِّنْ خَيْرٍۢ مِّن رَّبِّكُمْ ۗ وَٱللَّهُ يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ ۚ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
      "english_text": "Neither those from among the followers of earlier revelation who are bent on denying the truth, nor those who ascribe divinity to other beings beside God, would like to see any good ever bestowed upon you from on high by your Sustainer; but God singles out for His grace whom He wills-for God is limitless in His great bounty."
    },
    {
      "time": 1256,
      "surah": "Al-Baqara",
      "ayah": 106,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ مَا نَنسَخْ مِنْ ءَايَةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍۢ مِّنْهَآ أَوْ مِثْلِهَآ ۗ أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌ",
      "english_text": "Any message which, We annul or consign to oblivion We replace with a better or a similar one. Dost thou not know that God has the power to will anything?"
    },
    {
      "time": 1265,
      "surah": "Al-Baqara",
      "ayah": 107,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ لَهُۥ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۗ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِىٍّۢ وَلَا نَصِيرٍ",
      "english_text": "Dost thou not know that God's is the dominion over the heavens and the earth, and that besides God you have none to protect you or bring you succour?"
    },
    {
      "time": 1274,
      "surah": "Al-Baqara",
      "ayah": 108,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "أَمْ تُرِيدُونَ أَن تَسْـَٔلُوا۟ رَسُولَكُمْ كَمَا سُئِلَ مُوسَىٰ مِن قَبْلُ ۗ وَمَن يَتَبَدَّلِ ٱلْكُفْرَ بِٱلْإِيمَٰنِ فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ",
      "english_text": "Would you, perchance, ask of the Apostle who has been sent unto you what was asked aforetime of Moses? But whoever chooses to deny the [evidence of the] truth, instead of believing in it, has already strayed from the right path."
    },
    {
      "time": 1284,
      "surah": "Al-Baqara",
      "ayah": 109,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَدَّ كَثِيرٌۭ مِّنْ أَهْلِ ٱلْكِتَٰبِ لَوْ يَرُدُّونَكُم مِّنۢ بَعْدِ إِيمَٰنِكُمْ كُفَّارًا حَسَدًۭا مِّنْ عِندِ أَنفُسِهِم مِّنۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ ٱلْحَقُّ ۖ فَٱعْفُوا۟ وَٱصْفَحُوا۟ حَتَّىٰ يَأْتِىَ ٱللَّهُ بِأَمْرِهِۦٓ ۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
      "english_text": "Out of their selfish envy, many among the followers of earlier revelation would like to bring you back to denying the truth after you have attained to faith - [even] after the truth has become clear unto them. None the less, forgive and forbear, until God shall make manifest His will: behold, God has the power to will anything."
    },
    {
      "time": 1293,
      "surah": "Al-Baqara",
      "ayah": 110,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ ۚ وَمَا تُقَدِّمُوا۟ لِأَنفُسِكُم مِّنْ خَيْرٍۢ تَجِدُوهُ عِندَ ٱللَّهِ ۗ إِنَّ ٱللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌۭ",
      "english_text": "And be constant in prayer, and render the purifying dues; for, whatever good deed you send ahead for your own selves, you shall find it with God: behold, God sees all that you do."
    },
    {
      "time": 1302,
      "surah": "Al-Baqara",
      "ayah": 111,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَقَالُوا۟ لَن يَدْخُلَ ٱلْجَنَّةَ إِلَّا مَن كَانَ هُودًا أَوْ نَصَٰرَىٰ ۗ تِلْكَ أَمَانِيُّهُمْ ۗ قُلْ هَاتُوا۟ بُرْهَٰنَكُمْ إِن كُنتُمْ صَٰدِقِينَ",
      "english_text": "AND THEY claim, \"None shall ever enter paradise unless he be a Jew\" - or, \"a Christian\". Such are their wishful beliefs! Say: \"Produce an evidence for what you are claiming, if what you say is true!\""
    },
    {
      "time": 1311,
      "surah": "Al-Baqara",
      "ayah": 112,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "بَلَىٰ مَنْ أَسْلَمَ وَجْهَهُۥ لِلَّهِ وَهُوَ مُحْسِنٌۭ فَلَهُۥٓ أَجْرُهُۥ عِندَ رَبِّهِۦ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "english_text": "Yea, indeed: everyone who surrenders his whole being unto God, and is a doer of good withal, shall have his reward with his Sustainer; and all such need have no fear, and neither shall they grieve."
    },
    {
      "time": 1321,
      "surah": "Al-Baqara",
      "ayah": 113,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَقَالَتِ ٱلْيَهُودُ لَيْسَتِ ٱلنَّصَٰرَىٰ عَلَىٰ شَىْءٍۢ وَقَالَتِ ٱلنَّصَٰرَىٰ لَيْسَتِ ٱلْيَهُودُ عَلَىٰ شَىْءٍۢ وَهُمْ يَتْلُونَ ٱلْكِتَٰبَ ۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعْلَمُونَ مِثْلَ قَوْلِهِمْ ۚ فَٱللَّهُ يَحْكُمُ بَيْنَهُمْ يَوْمَ ٱلْقِيَٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
      "english_text": "Furthermore, the Jews assert, \"The Christians have no valid ground for their beliefs,\" while the Christians assert, \"The Jews have no valid ground for their beliefs\" - and both quote the divine writ! Even thus, like unto what they say, have [always] spoken those who were devoid of knowledge;\" but it is God who will judge between them on Resurrection Day with regard to all on which they were wont to differ."
    },
    {
      "time": 1330,
      "surah": "Al-Baqara",
      "ayah": 114,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَمَنْ أَظْلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذْكَرَ فِيهَا ٱسْمُهُۥ وَسَعَىٰ فِى خَرَابِهَآ ۚ أُو۟لَٰٓئِكَ مَا كَانَ لَهُمْ أَن يَدْخُلُوهَآ إِلَّا خَآئِفِينَ ۚ لَهُمْ فِى ٱلدُّنْيَا خِزْىٌۭ وَلَهُمْ فِى ٱلْءَاخِرَةِ عَذَابٌ عَظِيمٌۭ",
      "english_text": "Hence, who could be more wicked than those who bar the mention of God's name from [any of] His houses of worship and strive for their ruin, [although] they have no right to enter them save in fear [of God]? For them, in this world, there is ignominy in store; and for them, in the life to come, awesome suffering."
    },
    {
      "time": 1339,
      "surah": "Al-Baqara",
      "ayah": 115,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلِلَّهِ ٱلْمَشْرِقُ وَٱلْمَغْرِبُ ۚ فَأَيْنَمَا تُوَلُّوا۟ فَثَمَّ وَجْهُ ٱللَّهِ ۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٌۭ",
      "english_text": "And God's is the east and the west: and wherever you turn, there is God's countenance. Behold, God is infinite, all-knowing."
    },
    {
      "time": 1348,
      "surah": "Al-Baqara",
      "ayah": 116,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَقَالُوا۟ ٱتَّخَذَ ٱللَّهُ وَلَدًۭا ۗ سُبْحَٰنَهُۥ ۖ بَل لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۖ كُلٌّۭ لَّهُۥ قَٰنِتُونَ",
      "english_text": "And yet some people assert, \"God has taken unto Himself a son!\" Limitless is He in His glory! Nay, but His is all that is in the heavens and on earth; all things devoutly obey His will."
    },
    {
      "time": 1358,
      "surah": "Al-Baqara",
      "ayah": 117,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۖ وَإِذَا قَضَىٰٓ أَمْرًۭا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ",
      "english_text": "The Originator is He of the heavens and the earth: and when He wills a thing to be, He but says unto it, \"Be\" -and it is."
    },
    {
      "time": 1367,
      "surah": "Al-Baqara",
      "ayah": 118,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَقَالَ ٱلَّذِينَ لَا يَعْلَمُونَ لَوْلَا يُكَلِّمُنَا ٱللَّهُ أَوْ تَأْتِينَآ ءَايَةٌۭ ۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبْلِهِم مِّثْلَ قَوْلِهِمْ ۘ تَشَٰبَهَتْ قُلُوبُهُمْ ۗ قَدْ بَيَّنَّا ٱلْءَايَٰتِ لِقَوْمٍۢ يُوقِنُونَ",
      "english_text": "AND [only] those who are devoid of knowledge say, \"Why does God not speak unto us, nor is a [miraculous] sign shown to us?\" Even thus, like unto what they, say, spoke those who lived before their time their hearts are all alike. Indeed, We have made all the signs manifest unto people who are endowed with inner certainty."
    },
    {
      "time": 1376,
      "surah": "Al-Baqara",
      "ayah": 119,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "إِنَّآ أَرْسَلْنَٰكَ بِٱلْحَقِّ بَشِيرًۭا وَنَذِيرًۭا ۖ وَلَا تُسْـَٔلُ عَنْ أَصْحَٰبِ ٱلْجَحِيمِ",
      "english_text": "Verily, We have sent thee [O Prophet] with the truth, as a bearer of glad tidings and a warner: and thou shalt not be held accountable for those who are destined for the blazing fire."
    },
    {
      "time": 1385,
      "surah": "Al-Baqara",
      "ayah": 120,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَن تَرْضَىٰ عَنكَ ٱلْيَهُودُ وَلَا ٱلنَّصَٰرَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمْ ۗ قُلْ إِنَّ هُدَى ٱللَّهِ هُوَ ٱلْهُدَىٰ ۗ وَلَئِنِ ٱتَّبَعْتَ أَهْوَآءَهُم بَعْدَ ٱلَّذِى جَآءَكَ مِنَ ٱلْعِلْمِ ۙ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِىٍّۢ وَلَا نَصِيرٍ",
      "english_text": "For, never will the Jews be pleased with thee. nor yet the Christians, unless thou follow their own creeds. Say: \"Behold, God's guidance is the only true guidance.\" And, indeed, if thou shouldst follow their errant views after all the knowledge that has come unto thee. thou wouldst have none to protect thee from God, and none to bring thee succour."
    },
    {
      "time": 1395,
      "surah": "Al-Baqara",
      "ayah": 121,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ٱلَّذِينَ ءَاتَيْنَٰهُمُ ٱلْكِتَٰبَ يَتْلُونَهُۥ حَقَّ تِلَاوَتِهِۦٓ أُو۟لَٰٓئِكَ يُؤْمِنُونَ بِهِۦ ۗ وَمَن يَكْفُرْ بِهِۦ فَأُو۟لَٰٓئِكَ هُمُ ٱلْخَٰسِرُونَ",
      "english_text": "Those unto whom We have vouchsafed the divine writ [and who] follow it as it ought to be followed -it is they who [truly] believe in it; whereas all who choose to deny its truth -it is they, they who are the losers!"
    },
    {
      "time": 1404,
      "surah": "Al-Baqara",
      "ayah": 122,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَنِّى فَضَّلْتُكُمْ عَلَى ٱلْعَٰلَمِينَ",
      "english_text": "O CHILDREN of Israel! Remember those blessings of Mine with which I graced you, and how I favoured you above all other people;"
    },
    {
      "time": 1413,
      "surah": "Al-Baqara",
      "ayah": 123,
      "surah_number": 2,
      "juz": 1,
      "quality": "ambiguous",
      "reciter": "Hasan",
      "confidence": 0.777,
      "arabic_text": "وَٱتَّقُوا۟ يَوْمًۭا لَّا تَجْزِى نَفْسٌ عَن نَّفْسٍۢ شَيْـًۭٔا وَلَا يُقْبَلُ مِنْهَا عَدْلٌۭ وَلَا تَنفَعُهَا شَفَٰعَةٌۭ وَلَا هُمْ يُنصَرُونَ",
      "english_text": "and remain conscious of [the coming of] a Day when no human being shall in the least avail another, nor shall ransom be accepted from any of them, nor shall intercession be of any use to them, and none shall be succoured."
    },
    {
      "time": 1426,
      "surah": "Al-Baqara",
      "ayah": 124,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ وَإِذِ ٱبْتَلَىٰٓ إِبْرَٰهِۦمَ رَبُّهُۥ بِكَلِمَٰتٍۢ فَأَتَمَّهُنَّ ۖ قَالَ إِنِّى جَاعِلُكَ لِلنَّاسِ إِمَامًۭا ۖ قَالَ وَمِن ذُرِّيَّتِى ۖ قَالَ لَا يَنَالُ عَهْدِى ٱلظَّٰلِمِينَ",
      "english_text": "And [remember this:] when his Sustainer tried Abraham by [His] commandments and the latter fulfilled them, He said: \"Behold, I shall make thee a leader of men. \"Abraham asked: \"And [wilt Thou make leaders] of my offspring as well? \"[God] answered: \"My covenant does not embrace the evildoers.\""
    },
    {
      "time": 1439,
      "surah": "Al-Baqara",
      "ayah": 125,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ جَعَلْنَا ٱلْبَيْتَ مَثَابَةًۭ لِّلنَّاسِ وَأَمْنًۭا وَٱتَّخِذُوا۟ مِن مَّقَامِ إِبْرَٰهِۦمَ مُصَلًّۭى ۖ وَعَهِدْنَآ إِلَىٰٓ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ أَن طَهِّرَا بَيْتِىَ لِلطَّآئِفِينَ وَٱلْعَٰكِفِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ",
      "english_text": "AND LO! We made the Temple a goal to which people might repair again and again, and a sanctuary: take then, the place whereon Abraham once stood as your place of prayer.\" And thus did We command Abraham and Ishmael: \"Purify My Temple for those who will walk around it, and those who will abide near it in meditation, and those who will bow down and prostrate themselves [in prayer].\""
    },
    {
      "time": 1452,
      "surah": "Al-Baqara",
      "ayah": 126,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ قَالَ إِبْرَٰهِۦمُ رَبِّ ٱجْعَلْ هَٰذَا بَلَدًا ءَامِنًۭا وَٱرْزُقْ أَهْلَهُۥ مِنَ ٱلثَّمَرَٰتِ مَنْ ءَامَنَ مِنْهُم بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ ۖ قَالَ وَمَن كَفَرَ فَأُمَتِّعُهُۥ قَلِيلًۭا ثُمَّ أَضْطَرُّهُۥٓ إِلَىٰ عَذَابِ ٱلنَّارِ ۖ وَبِئْسَ ٱلْمَصِيرُ",
      "english_text": "And, lo, Abraham prayed: \"O my Sustainer! Make this a land secure, and grant its people fruitful sustenance - such of them as believe in God and the Last Day.\" [God] answered: \"And whoever shall deny the truth, him will I let enjoy himself for a short while -but in the end I shall drive him to suffering through fire: and how vile a journey's end!\""
    },
    {
      "time": 1465,
      "surah": "Al-Baqara",
      "ayah": 127,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَإِذْ يَرْفَعُ إِبْرَٰهِۦمُ ٱلْقَوَاعِدَ مِنَ ٱلْبَيْتِ وَإِسْمَٰعِيلُ رَبَّنَا تَقَبَّلْ مِنَّآ ۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
      "english_text": "And when Abraham and Ishmael were raising the foundations of the Temple, [they prayed:] \"O our Sustainer! Accept Thou this from us: for, verily, Thou alone art all-hearing, all-knowing!"
    },
    {
      "time": 1478,
      "surah": "Al-Baqara",
      "ayah": 128,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "رَبَّنَا وَٱجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةًۭ مُّسْلِمَةًۭ لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ ۖ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
      "english_text": "\"O our Sustainer! Make us surrender ourselves unto Thee, and make out of our offspring a community that shall surrender itself unto Thee, and show us our ways of worship, and accept our repentance: for, verily, Thou alone art the Acceptor of Repentance, the Dispenser of Grace!"
    },
    {
      "time": 1491,
      "surah": "Al-Baqara",
      "ayah": 129,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "رَبَّنَا وَٱبْعَثْ فِيهِمْ رَسُولًۭا مِّنْهُمْ يَتْلُوا۟ عَلَيْهِمْ ءَايَٰتِكَ وَيُعَلِّمُهُمُ ٱلْكِتَٰبَ وَٱلْحِكْمَةَ وَيُزَكِّيهِمْ ۚ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "english_text": "\"O our Sustainer! Raise up from the midst of our off spring an apostle from among themselves, who shall convey unto them Thy messages, and impart unto them revelation as well as wisdom, and cause them to grow in purity: for, verily, Thou alone art almighty, truly wise!\""
    },
    {
      "time": 1504,
      "surah": "Al-Baqara",
      "ayah": 130,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَمَن يَرْغَبُ عَن مِّلَّةِ إِبْرَٰهِۦمَ إِلَّا مَن سَفِهَ نَفْسَهُۥ ۚ وَلَقَدِ ٱصْطَفَيْنَٰهُ فِى ٱلدُّنْيَا ۖ وَإِنَّهُۥ فِى ٱلْءَاخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ",
      "english_text": "And who, unless he be weak of mind, would want to abandon Abraham's creed, seeing that We have indeed raised him high in this world, and that, verily, in the life to come he shall be among the righteous?"
    },
    {
      "time": 1517,
      "surah": "Al-Baqara",
      "ayah": 131,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "إِذْ قَالَ لَهُۥ رَبُّهُۥٓ أَسْلِمْ ۖ قَالَ أَسْلَمْتُ لِرَبِّ ٱلْعَٰلَمِينَ",
      "english_text": "When his Sustainer said to him, \"Surrender thyself unto Me!\" - he answered, \"I have surrendered myself unto [Thee,] the Sustainer of all the worlds.\""
    },
    {
      "time": 1530,
      "surah": "Al-Baqara",
      "ayah": 132,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَوَصَّىٰ بِهَآ إِبْرَٰهِۦمُ بَنِيهِ وَيَعْقُوبُ يَٰبَنِىَّ إِنَّ ٱللَّهَ ٱصْطَفَىٰ لَكُمُ ٱلدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ",
      "english_text": "And this very thing did Abraham bequeath unto his children, and [so did] Jacob: \"O my children! Behold, God has granted you the purest faith; so do not allow death to overtake you ere you have surrendered yourselves unto Him.\""
    },
    {
      "time": 1543,
      "surah": "Al-Baqara",
      "ayah": 133,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "أَمْ كُنتُمْ شُهَدَآءَ إِذْ حَضَرَ يَعْقُوبَ ٱلْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِنۢ بَعْدِى قَالُوا۟ نَعْبُدُ إِلَٰهَكَ وَإِلَٰهَ ءَابَآئِكَ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ وَإِسْحَٰقَ إِلَٰهًۭا وَٰحِدًۭا وَنَحْنُ لَهُۥ مُسْلِمُونَ",
      "english_text": "Nay, but you [yourselves, O children of Israel,] bear witness that when death was approaching Jacob, he said unto his sons: \"Whom will you worship after I am gone?\" They answered: \"We will worship thy God, the God of thy forefathers Abraham and Ishmael and Isaac, the One God; and unto Him we surrender ourselves.\""
    },
    {
      "time": 1556,
      "surah": "Al-Baqara",
      "ayah": 134,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "تِلْكَ أُمَّةٌۭ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ ۖ وَلَا تُسْـَٔلُونَ عَمَّا كَانُوا۟ يَعْمَلُونَ",
      "english_text": "Now those people have passed away; unto them shall be accounted what they have earned, and unto you, what you have earned; and you will not be, judged on the strength of what they did."
    },
    {
      "time": 1569,
      "surah": "Al-Baqara",
      "ayah": 135,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَقَالُوا۟ كُونُوا۟ هُودًا أَوْ نَصَٰرَىٰ تَهْتَدُوا۟ ۗ قُلْ بَلْ مِلَّةَ إِبْرَٰهِۦمَ حَنِيفًۭا ۖ وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
      "english_text": "AND THEY say, \"Be Jews\" - or, \"Christians\" - \"and you shall be on the right path.\" Say: \"Nay, but [ours is] the creed of Abraham, who turned away from all that is false, and was not of those who ascribe divinity to aught beside God.\""
    },
    {
      "time": 1582,
      "surah": "Al-Baqara",
      "ayah": 136,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قُولُوٓا۟ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيْنَا وَمَآ أُنزِلَ إِلَىٰٓ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ وَإِسْحَٰقَ وَيَعْقُوبَ وَٱلْأَسْبَاطِ وَمَآ أُوتِىَ مُوسَىٰ وَعِيسَىٰ وَمَآ أُوتِىَ ٱلنَّبِيُّونَ مِن رَّبِّهِمْ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّنْهُمْ وَنَحْنُ لَهُۥ مُسْلِمُونَ",
      "english_text": "Say: \"We believe in God, and in that which has been bestowed from on high upon us, and that which has been bestowed upon Abraham and Ishmael and Isaac and Jacob and, their descendants, and that which has been vouchsafed to Moses and Jesus; and that which has been vouchsafed to all the [other] prophets by their Sustainer: we make no distinction between any of them. And it is unto Him that we surrender ourselves.\""
    },
    {
      "time": 1595,
      "surah": "Al-Baqara",
      "ayah": 137,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "فَإِنْ ءَامَنُوا۟ بِمِثْلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهْتَدَوا۟ ۖ وَّإِن تَوَلَّوْا۟ فَإِنَّمَا هُمْ فِى شِقَاقٍۢ ۖ فَسَيَكْفِيكَهُمُ ٱللَّهُ ۚ وَهُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
      "english_text": "And if [others] come to believe in the way you believe, they will indeed find themselves on the right path; and if they turn away, it is but they who will be deeply in the wrong, and God will protect thee from them: for He alone is all-hearing, all-knowing."
    },
    {
      "time": 1608,
      "surah": "Al-Baqara",
      "ayah": 138,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "صِبْغَةَ ٱللَّهِ ۖ وَمَنْ أَحْسَنُ مِنَ ٱللَّهِ صِبْغَةًۭ ۖ وَنَحْنُ لَهُۥ عَٰبِدُونَ",
      "english_text": "[Say: \"Our life takes its] hue from God! And who could give a better hue [to life] than God, if we but truly worship Him?\""
    },
    {
      "time": 1621,
      "surah": "Al-Baqara",
      "ayah": 139,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قُلْ أَتُحَآجُّونَنَا فِى ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَآ أَعْمَٰلُنَا وَلَكُمْ أَعْمَٰلُكُمْ وَنَحْنُ لَهُۥ مُخْلِصُونَ",
      "english_text": "Say [to the Jews and the Christians]: \"Do you argue with us about God? But He is our Sustainer as well as your Sustainer - and unto us shall be accounted our deeds, and unto you, your deeds; and it- is unto Him alone that we devote ourselves."
    },
    {
      "time": 1634,
      "surah": "Al-Baqara",
      "ayah": 140,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "أَمْ تَقُولُونَ إِنَّ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ وَإِسْحَٰقَ وَيَعْقُوبَ وَٱلْأَسْبَاطَ كَانُوا۟ هُودًا أَوْ نَصَٰرَىٰ ۗ قُلْ ءَأَنتُمْ أَعْلَمُ أَمِ ٱللَّهُ ۗ وَمَنْ أَظْلَمُ مِمَّن كَتَمَ شَهَٰدَةً عِندَهُۥ مِنَ ٱللَّهِ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
      "english_text": "\"Do you claim that Abraham and Ishmael and Isaac and Jacob and their descendants were `Jews' or `Christians'?\" Say: \"Do you know more than God does? And who could be more wicked than he who suppresses a testimony given to him by God? Yet God is not unmindful of what you do."
    },
    {
      "time": 1647,
      "surah": "Al-Baqara",
      "ayah": 141,
      "surah_number": 2,
      "juz": 1,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "تِلْكَ أُمَّةٌۭ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ ۖ وَلَا تُسْـَٔلُونَ عَمَّا كَانُوا۟ يَعْمَلُونَ",
      "english_text": "\"Now those people have passed away; unto them shall be accounted what they have earned, and unto you, what you have earned; and you will not be judged on the strength of what they did.\""
    },
    {
      "time": 1660,
      "surah": "Al-Baqara",
      "ayah": 142,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمْ عَن قِبْلَتِهِمُ ٱلَّتِى كَانُوا۟ عَلَيْهَا ۚ قُل لِّلَّهِ ٱلْمَشْرِقُ وَٱلْمَغْرِبُ ۚ يَهْدِى مَن يَشَآءُ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
      "english_text": "THE WEAK-MINDED among people will say, \"What has turned them away from the direction of prayer which they have hitherto observed?\" Say: \"God's is the east and the west; He guides whom He wills onto a straight way.\""
    },
    {
      "time": 1673,
      "surah": "Al-Baqara",
      "ayah": 143,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَكَذَٰلِكَ جَعَلْنَٰكُمْ أُمَّةًۭ وَسَطًۭا لِّتَكُونُوا۟ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيدًۭا ۗ وَمَا جَعَلْنَا ٱلْقِبْلَةَ ٱلَّتِى كُنتَ عَلَيْهَآ إِلَّا لِنَعْلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيْهِ ۚ وَإِن كَانَتْ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُ ۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَٰنَكُمْ ۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٌۭ رَّحِيمٌۭ",
      "english_text": "And thus have We willed you to be a community of the middle way, so that [with your lives] you might bear witness to the truth before all mankind, and that the Apostle might bear witness to it before you. And it is only to the end that We might make a clear distinction between those who follow the Apostle and those who turn about on their heels that We have appointed [for this community] the direction of prayer which thou [O Prophet] hast formerly observed: for this was indeed a hard test for all but those whom God has guided aright. But God will surely not lose sight of your faith-for, behold, God is most compassionate towards man, a dispenser of grace."
    },
    {
      "time": 1686,
      "surah": "Al-Baqara",
      "ayah": 144,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "قَدْ نَرَىٰ تَقَلُّبَ وَجْهِكَ فِى ٱلسَّمَآءِ ۖ فَلَنُوَلِّيَنَّكَ قِبْلَةًۭ تَرْضَىٰهَا ۚ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا۟ وُجُوهَكُمْ شَطْرَهُۥ ۗ وَإِنَّ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ لَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا يَعْمَلُونَ",
      "english_text": "We have seen thee [O Prophet] often turn thy face towards heaven [for guidance]: and now We shall indeed make thee turn in prayer in a direction which will fulfil thy desire. Turn, then, thy face towards the Inviolable House of Worship; and wherever you all may be, turn your faces towards it [in prayer]. And, verily, those who have been vouchsafed revelation aforetime know well that this [commandment] comes in truth from their Sustainer; and God is not unaware of what they do."
    },
    {
      "time": 1699,
      "surah": "Al-Baqara",
      "ayah": 145,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَئِنْ أَتَيْتَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ بِكُلِّ ءَايَةٍۢ مَّا تَبِعُوا۟ قِبْلَتَكَ ۚ وَمَآ أَنتَ بِتَابِعٍۢ قِبْلَتَهُمْ ۚ وَمَا بَعْضُهُم بِتَابِعٍۢ قِبْلَةَ بَعْضٍۢ ۚ وَلَئِنِ ٱتَّبَعْتَ أَهْوَآءَهُم مِّنۢ بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ ۙ إِنَّكَ إِذًۭا لَّمِنَ ٱلظَّٰلِمِينَ",
      "english_text": "And yet, even if thou wert to place all evidence before those who have been vouchsafed earlier revelation, they would not follow thy direction of prayer; and neither mayest thou follow their direction of prayer, nor even do they follow one another's direction. And if thou shouldst follow their errant views after all the knowledge that has come unto thee thou wouldst surely be among the evildoers."
    },
    {
      "time": 1712,
      "surah": "Al-Baqara",
      "ayah": 146,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ٱلَّذِينَ ءَاتَيْنَٰهُمُ ٱلْكِتَٰبَ يَعْرِفُونَهُۥ كَمَا يَعْرِفُونَ أَبْنَآءَهُمْ ۖ وَإِنَّ فَرِيقًۭا مِّنْهُمْ لَيَكْتُمُونَ ٱلْحَقَّ وَهُمْ يَعْلَمُونَ",
      "english_text": "They unto whom We have vouchsafed revelation aforetime know it as they know their own children: but, behold, some of them knowingly suppress the truth -"
    },
    {
      "time": 1725,
      "surah": "Al-Baqara",
      "ayah": 147,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ٱلْحَقُّ مِن رَّبِّكَ ۖ فَلَا تَكُونَنَّ مِنَ ٱلْمُمْتَرِينَ",
      "english_text": "the truth from thy Sustainer! Be not, then, among the doubters:"
    },
    {
      "time": 1738,
      "surah": "Al-Baqara",
      "ayah": 148,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلِكُلٍّۢ وِجْهَةٌ هُوَ مُوَلِّيهَا ۖ فَٱسْتَبِقُوا۟ ٱلْخَيْرَٰتِ ۚ أَيْنَ مَا تَكُونُوا۟ يَأْتِ بِكُمُ ٱللَّهُ جَمِيعًا ۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
      "english_text": "for, every community faces a direction of its own, of which He is the focal point. Vie, therefore, with one another in doing good works. Wherever you may be, God will gather you all unto Himself: for, verily, God has the power to will anything."
    },
    {
      "time": 1751,
      "surah": "Al-Baqara",
      "ayah": 149,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۖ وَإِنَّهُۥ لَلْحَقُّ مِن رَّبِّكَ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
      "english_text": "Thus, from wherever thou mayest come forth, turn thy face [in prayer] towards the Inviolable House of Worship-for,. behold, this [commandment] comes in truth from thy Sustainer; and God is not unaware of what you do."
    },
    {
      "time": 1764,
      "surah": "Al-Baqara",
      "ayah": 150,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا۟ وُجُوهَكُمْ شَطْرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُوا۟ مِنْهُمْ فَلَا تَخْشَوْهُمْ وَٱخْشَوْنِى وَلِأُتِمَّ نِعْمَتِى عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُونَ",
      "english_text": "Hence, from wherever thou mayest come forth, turn thy face [in prayer] towards the Inviolable House of Worship; and wherever you all may be, turn your faces towards it, so that people should have no argument against you unless they are bent upon wrongdoing. And hold not them in awe, but stand in awe of Me, and [obey Me,] so that I might bestow upon you the full measure of My blessings., and that you might follow the right path."
    },
    {
      "time": 1777,
      "surah": "Al-Baqara",
      "ayah": 151,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "كَمَآ أَرْسَلْنَا فِيكُمْ رَسُولًۭا مِّنكُمْ يَتْلُوا۟ عَلَيْكُمْ ءَايَٰتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ ٱلْكِتَٰبَ وَٱلْحِكْمَةَ وَيُعَلِّمُكُم مَّا لَمْ تَكُونُوا۟ تَعْلَمُونَ",
      "english_text": "Even as We have sent unto you an apostle from among yourselves to convey unto you Our messages, and to cause you to grow in purity, and to impart unto you revelation and wisdom, and to teach you that which you knew not:"
    },
    {
      "time": 1790,
      "surah": "Al-Baqara",
      "ayah": 152,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "فَٱذْكُرُونِىٓ أَذْكُرْكُمْ وَٱشْكُرُوا۟ لِى وَلَا تَكْفُرُونِ",
      "english_text": "so remember Me, and I shall remember you; and be grateful unto Me, and deny Me not."
    },
    {
      "time": 1803,
      "surah": "Al-Baqara",
      "ayah": 153,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ",
      "english_text": "O YOU who have attained to faith! Seek aid in steadfast patience and prayer: for, behold, God is with those who are patient in adversity."
    },
    {
      "time": 1816,
      "surah": "Al-Baqara",
      "ayah": 154,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَا تَقُولُوا۟ لِمَن يُقْتَلُ فِى سَبِيلِ ٱللَّهِ أَمْوَٰتٌۢ ۚ بَلْ أَحْيَآءٌۭ وَلَٰكِن لَّا تَشْعُرُونَ",
      "english_text": "And say not of those who are slain in God's cause, \"They are dead\": nay, they are alive, but you perceive it not."
    },
    {
      "time": 1829,
      "surah": "Al-Baqara",
      "ayah": 155,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "وَلَنَبْلُوَنَّكُم بِشَىْءٍۢ مِّنَ ٱلْخَوْفِ وَٱلْجُوعِ وَنَقْصٍۢ مِّنَ ٱلْأَمْوَٰلِ وَٱلْأَنفُسِ وَٱلثَّمَرَٰتِ ۗ وَبَشِّرِ ٱلصَّٰبِرِينَ",
      "english_text": "And most certainly shall We try you by means of danger, and hunger, and loss of worldly goods, of lives and of [labour's] fruits. But give glad tidings unto those who are patient in adversity"
    },
    {
      "time": 1842,
      "surah": "Al-Baqara",
      "ayah": 156,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "ٱلَّذِينَ إِذَآ أَصَٰبَتْهُم مُّصِيبَةٌۭ قَالُوٓا۟ إِنَّا لِلَّهِ وَإِنَّآ إِلَيْهِ رَٰجِعُونَ",
      "english_text": "who, when calamity befalls them, say, \"Verily, unto God do we belong and, verily, unto Him we shall return.\""
    },
    {
      "time": 1855,
      "surah": "Al-Baqara",
      "ayah": 157,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "أُو۟لَٰٓئِكَ عَلَيْهِمْ صَلَوَٰتٌۭ مِّن رَّبِّهِمْ وَرَحْمَةٌۭ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُهْتَدُونَ",
      "english_text": "It is they upon whom their Sustainer's blessings and grace are bestowed, and it is they, they who are on the right path!"
    },
    {
      "time": 1868,
      "surah": "Al-Baqara",
      "ayah": 158,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "۞ إِنَّ ٱلصَّفَا وَٱلْمَرْوَةَ مِن شَعَآئِرِ ٱللَّهِ ۖ فَمَنْ حَجَّ ٱلْبَيْتَ أَوِ ٱعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا ۚ وَمَن تَطَوَّعَ خَيْرًۭا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ",
      "english_text": "[Hence,] behold, As-Safa and Al-Marwah are among the symbols set up by God; and thus, no wrong does he who, having come to the Temple on pilgrimage or on a pious visit, strides to and fro between these two: for, if one does more good than he is bound to do-behold, God is responsive to gratitude, all-knowing."
    },
    {
      "time": 1881,
      "surah": "Al-Baqara",
      "ayah": 159,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "إِنَّ ٱلَّذِينَ يَكْتُمُونَ مَآ أَنزَلْنَا مِنَ ٱلْبَيِّنَٰتِ وَٱلْهُدَىٰ مِنۢ بَعْدِ مَا بَيَّنَّٰهُ لِلنَّاسِ فِى ٱلْكِتَٰبِ ۙ أُو۟لَٰٓئِكَ يَلْعَنُهُمُ ٱللَّهُ وَيَلْعَنُهُمُ ٱللَّٰعِنُونَ",
      "english_text": "BEHOLD, as for those who suppress aught of the evidence of the truth and of the guidance which We have bestowed from on high, after We have made it clear unto mankind through the divine writ - these it is whom God will reject, and whom all who can judge will reject."
    },
    {
      "time": 1894,
      "surah": "Al-Baqara",
      "ayah": 160,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "إِلَّا ٱلَّذِينَ تَابُوا۟ وَأَصْلَحُوا۟ وَبَيَّنُوا۟ فَأُو۟لَٰٓئِكَ أَتُوبُ عَلَيْهِمْ ۚ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ",
      "english_text": "Excepted, however, shall be they that repent, and put themselves to rights, and make known the truth: and it is they whose repentance I shall accept-for I alone am the Acceptor of Repentance, the Dispenser of Grace."
    },
    {
      "time": 1907,
      "surah": "Al-Baqara",
      "ayah": 161,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَمَاتُوا۟ وَهُمْ كُفَّارٌ أُو۟لَٰٓئِكَ عَلَيْهِمْ لَعْنَةُ ٱللَّهِ وَٱلْمَلَٰٓئِكَةِ وَٱلنَّاسِ أَجْمَعِينَ",
      "english_text": "Behold, as for those who are bent on denying the truth and die as deniers of the truth -their due is rejection by God, and by the angels,, and by all [righteous] men."
    },
    {
      "time": 1920,
      "surah": "Al-Baqara",
      "ayah": 162,
      "surah_number": 2,
      "juz": 2,
      "quality": "inferred",
      "reciter": "Hasan",
      "confidence": 0.56,
      "arabic_text": "خَٰلِدِينَ فِيهَا ۖ لَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنظَرُونَ",
      "english_text": "In this state shall they abide; [and] neither will their suffering, be lightened, nor will they be granted respite."
    },
    {
      "time": 2011,
      "surah": "Aal-i-Imraan",
      "ayah": 112,
      "surah_number": 3,
      "juz": 4,
      "quality": "high",
      "reciter": "Hasan",
      "confidence": 0.64,
      "arabic_text": "ضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ أَيْنَ مَا ثُقِفُوٓا۟ إِلَّا بِحَبْلٍۢ مِّنَ ٱللَّهِ وَحَبْلٍۢ مِّنَ ٱلنَّاسِ وَبَآءُو بِغَضَبٍۢ مِّنَ ٱللَّهِ وَضُرِبَتْ عَلَيْهِمُ ٱلْمَسْكَنَةُ ۚ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلْأَنۢبِيَآءَ بِغَيْرِ حَقٍّۢ ۚ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
      "english_text": "Overshadowed by ignominy are they wherever they may be, save [when they bind themselves again] in a bond with God and a bond with men; for they have earned the burden of God's condemnation, and are overshadowed by humiliation: all this [has befallen them] because they persisted in denying the truth of God's messages and in slaying the prophets against all right: all this, because they rebelled [against God], and persisted in transgressing the bounds of what is right."
    }
  ],
  "meta": {
    "generated_at": "2026-02-19T18:58:04.232588+00:00",
    "audio_path": "data/audio/day-1/normalized.wav",
    "whisper_model": "small",
    "markers_detected": 164,
    "reciter_segments_detected": 13,
    "corpus_loaded": true,
    "asad_loaded": true,
    "transcript_path": "data/ai/cache/day-1-transcript-full.json",
    "segment_detection": {
      "audio_starts": 8,
      "fatiha_starts": 12,
      "merged_starts": 13
    },
    "match_config": {
      "min_score": 84,
      "min_overlap": 0.15,
      "min_confidence": 0.68,
      "min_gap_seconds": 8
    }
  }
}